                         #ASSIGNMENT QUESTION -3

In [ ]:
#1) import pandas and read the data into an data frame. print the first five rows of the data frame.

In [25]:
import pandas as pd
df= pd.read_excel("C:\\Users\Shameena\Downloads\padas_question.xlsx")
print(df)

      Name  Gender  Age  Height (cm)  Weight (kg)         City
0    Alice  Female   25          165           58     New York
1      Bob    Male   30          180           80  Los Angeles
2  Charlie    Male   35          175           70      Chicago
3    Diana  Female   28          170           65        Miami
4      Eva  Female   27          175           60     New York
5    Frank    Male   40          190           85      Houston
6    Grace  Female   32          168           55      Chicago
7    Henry    Male   45          175           75  Los Angeles
8      Ivy  Female   26          172           63        Miami
9     Jack    Male   28          180           78     New York

In [3]:
df.head()

      Name  Gender  Age  Height (cm)  Weight (kg)         City
0    Alice  Female   25          165           58     New York
1      Bob    Male   30          180           80  Los Angeles
2  Charlie    Male   35          175           70      Chicago
3    Diana  Female   28          170           65        Miami
4      Eva  Female   27          175           60     New York

In [4]:
#2)print the numbers of rows and columns in the data frame

In [5]:
print("number of rows:",df.shape[0])
print("number of column:",df.shape[1])

number of rows: 10
number of column: 6

In [6]:
#3)print the null value count

In [7]:
null_counts = df.isnull().sum()
print("null value counts")
print(null_counts)

null value counts
Name           0
Gender         0
Age            0
Height (cm)    0
Weight (kg)    0
City           0
dtype: int64

In [8]:
#4)print the average age ,height and weight ofthe people inthe data frame

In [30]:
avg_age = df['Age'].mean()
avg_height = df['Height (cm)'].mean()
avg_weight = df['Weight (kg)'].mean()

print("Average Age:", avg_age)
print("Average Height:", avg_height)
print("Average Weight:", avg_weight)

Average Age: 31.6
Average Height: 175.0
Average Weight: 68.9

In [36]:
#5)print the name and city of the person who is tallest in the data frame

In [35]:
tallest_index = df['Height (cm)'].idxmax()

# Getting the name and city of the tallest person
tallest_name = df.loc[tallest_index, 'Name']
tallest_city = df.loc[tallest_index, 'City']
print("Name of the tallest person:", tallest_name)
print("City of the tallest person:", tallest_city)

Name of the tallest person: Frank
City of the tallest person: Houston

In [ ]:
#6)create a new colum  IN THE data frame"BMI"that calculates the body mass index ofeach person

In [13]:

df['BMI'] = df['Weight (kg)'] / (df[' Height (cm)'] ** 2) 
print(df)

NameError: name 'df' is not defined

In [6]:
#7) group the data by gender and print the average age ,height, and weight of males and females seperately.

In [21]:
avg_data = df.groupby('Gender').mean()
print(avg_data)

         Age  Height (cm)  Weight (kg)
Gender
Female  27.6        170.0         60.2
Male    35.6        180.0         77.6

C:\Users\Shameena\AppData\Local\Temp\ipykernel_15052\2032972165.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  avg_data = df.groupby('Gender').mean()

In [12]:
#8) sort the data by age in ascending order and print the first 3 rows of  the sorted data frame.

In [17]:


sorted_df = df.sort_values(by='Age')
print(sorted_df.head(3))

    Name  Gender  Age  Height (cm)  Weight (kg)      City
0  Alice  Female   25          165           58  New York
8    Ivy  Female   26          172           63     Miami
4    Eva  Female   27          175           60  New York

In [13]:
#9) filter the data to only include people who live in new york and print the resulting data frame

In [19]:
ny_df = df[df['City'] == 'New York']
print(ny_df)

    Name  Gender  Age  Height (cm)  Weight (kg)      City
0  Alice  Female   25          165           58  New York
4    Eva  Female   27          175           60  New York
9   Jack    Male   28          180           78  New York